----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 64, 80, 60]           1,792
         MaxPool2d-2           [-1, 64, 40, 30]               0
            Conv2d-3          [-1, 128, 20, 15]           8,192
              ReLU-4           [-1, 64, 40, 30]               0
            Conv2d-5          [-1, 128, 20, 15]          73,856
       BatchNorm2d-6          [-1, 128, 20, 15]             256
              ReLU-7          [-1, 128, 20, 15]               0
            Conv2d-8          [-1, 128, 20, 15]         147,584
       BatchNorm2d-9          [-1, 128, 20, 15]             256
         ResBlock-10          [-1, 128, 20, 15]               0
           Conv2d-11           [-1, 256, 10, 5]          32,768
             ReLU-12          [-1, 128, 20, 15]               0
           Conv2d-13           [-1, 256, 10, 5]         295,168
      BatchNorm2d-14           [-1, 256, 10, 5]             512
             ReLU-15           [-1, 256, 10, 5]               0
           Conv2d-16           [-1, 256, 10, 5]         590,080
      BatchNorm2d-17           [-1, 256, 10, 5]             512
         ResBlock-18           [-1, 256, 10, 5]               0
           Conv2d-19            [-1, 512, 5, 5]         131,072
             ReLU-20           [-1, 256, 10, 5]               0
           Conv2d-21            [-1, 512, 5, 5]       1,180,160
      BatchNorm2d-22            [-1, 512, 5, 5]           1,024
             ReLU-23            [-1, 512, 5, 5]               0
           Conv2d-24            [-1, 512, 5, 5]       2,359,808
      BatchNorm2d-25            [-1, 512, 5, 5]           1,024
         ResBlock-26            [-1, 512, 5, 5]               0
        AvgPool2d-27            [-1, 512, 1, 1]               0
           Linear-28                   [-1, 15]           7,695
          Softmax-29                   [-1, 15]               0
================================================================
Total params: 4,831,759
Trainable params: 4,831,759
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.05
Forward/backward pass size (MB): 7.33
Params size (MB): 18.43
Estimated Total Size (MB): 25.81
----------------------------------------------------------------