Old:
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 64, 80, 60]           1,792
         MaxPool2d-2           [-1, 64, 40, 30]               0
            Conv2d-3          [-1, 128, 40, 30]           8,192
              ReLU-4           [-1, 64, 40, 30]               0
            Conv2d-5          [-1, 128, 40, 30]          73,856
       BatchNorm2d-6          [-1, 128, 40, 30]             256
              ReLU-7          [-1, 128, 40, 30]               0
            Conv2d-8          [-1, 128, 40, 30]         147,584
       BatchNorm2d-9          [-1, 128, 40, 30]             256
         ResBlock-10          [-1, 128, 40, 30]               0
           Conv2d-11          [-1, 256, 40, 30]          32,768
             ReLU-12          [-1, 128, 40, 30]               0
           Conv2d-13          [-1, 256, 40, 30]         295,168
      BatchNorm2d-14          [-1, 256, 40, 30]             512
             ReLU-15          [-1, 256, 40, 30]               0
           Conv2d-16          [-1, 256, 40, 30]         590,080
      BatchNorm2d-17          [-1, 256, 40, 30]             512
         ResBlock-18          [-1, 256, 40, 30]               0
           Conv2d-19          [-1, 512, 40, 30]         131,072
             ReLU-20          [-1, 256, 40, 30]               0
           Conv2d-21          [-1, 512, 40, 30]       1,180,160
      BatchNorm2d-22          [-1, 512, 40, 30]           1,024
             ReLU-23          [-1, 512, 40, 30]               0
           Conv2d-24          [-1, 512, 40, 30]       2,359,808
      BatchNorm2d-25          [-1, 512, 40, 30]           1,024
         ResBlock-26          [-1, 512, 40, 30]               0
           Conv2d-27         [-1, 1024, 40, 30]         524,288
             ReLU-28          [-1, 512, 40, 30]               0
           Conv2d-29         [-1, 1024, 40, 30]       4,719,616
      BatchNorm2d-30         [-1, 1024, 40, 30]           2,048
             ReLU-31         [-1, 1024, 40, 30]               0
           Conv2d-32         [-1, 1024, 40, 30]       9,438,208
      BatchNorm2d-33         [-1, 1024, 40, 30]           2,048
         ResBlock-34         [-1, 1024, 40, 30]               0
        AvgPool2d-35           [-1, 1024, 8, 6]               0
           Linear-36                 [-1, 1000]      49,153,000
             ReLU-37                 [-1, 1000]               0
           Linear-38                   [-1, 15]          15,015
          Softmax-39                   [-1, 15]               0
================================================================
Total params: 68,678,287
Trainable params: 68,678,287
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.05
Forward/backward pass size (MB): 135.16
Params size (MB): 261.99
Estimated Total Size (MB): 397.20
----------------------------------------------------------------



Simplified:
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 64, 80, 60]           1,792
         MaxPool2d-2           [-1, 64, 40, 30]               0
            Conv2d-3          [-1, 128, 40, 30]           8,192
              ReLU-4           [-1, 64, 40, 30]               0
            Conv2d-5          [-1, 128, 40, 30]          73,856
       BatchNorm2d-6          [-1, 128, 40, 30]             256
              ReLU-7          [-1, 128, 40, 30]               0
            Conv2d-8          [-1, 128, 40, 30]         147,584
       BatchNorm2d-9          [-1, 128, 40, 30]             256
         ResBlock-10          [-1, 128, 40, 30]               0
           Conv2d-11          [-1, 256, 20, 30]          32,768
             ReLU-12          [-1, 128, 40, 30]               0
           Conv2d-13          [-1, 256, 20, 30]         295,168
      BatchNorm2d-14          [-1, 256, 20, 30]             512
             ReLU-15          [-1, 256, 20, 30]               0
           Conv2d-16          [-1, 256, 20, 30]         590,080
      BatchNorm2d-17          [-1, 256, 20, 30]             512
         ResBlock-18          [-1, 256, 20, 30]               0
           Conv2d-19          [-1, 512, 10, 15]         131,072
             ReLU-20          [-1, 256, 20, 30]               0
           Conv2d-21          [-1, 512, 10, 15]       1,180,160
      BatchNorm2d-22          [-1, 512, 10, 15]           1,024
             ReLU-23          [-1, 512, 10, 15]               0
           Conv2d-24          [-1, 512, 10, 15]       2,359,808
      BatchNorm2d-25          [-1, 512, 10, 15]           1,024
         ResBlock-26          [-1, 512, 10, 15]               0
           Conv2d-27           [-1, 1024, 5, 5]         524,288
             ReLU-28          [-1, 512, 10, 15]               0
           Conv2d-29           [-1, 1024, 5, 5]       4,719,616
      BatchNorm2d-30           [-1, 1024, 5, 5]           2,048
             ReLU-31           [-1, 1024, 5, 5]               0
           Conv2d-32           [-1, 1024, 5, 5]       9,438,208
      BatchNorm2d-33           [-1, 1024, 5, 5]           2,048
         ResBlock-34           [-1, 1024, 5, 5]               0
        AvgPool2d-35           [-1, 1024, 1, 1]               0
           Linear-36                 [-1, 1000]       1,025,000
             ReLU-37                 [-1, 1000]               0
           Linear-38                   [-1, 15]          15,015
          Softmax-39                   [-1, 15]               0
================================================================
Total params: 20,550,287
Trainable params: 20,550,287
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.05
Forward/backward pass size (MB): 28.34
Params size (MB): 78.39
Estimated Total Size (MB): 106.79
----------------------------------------------------------------